In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [13]:
df=pd.read_csv('train.csv')

In [15]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [9]:
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [19]:
df.drop(columns=['PassengerId','Name','Ticket','Cabin'],inplace=True)

In [21]:
df.head(1)

   Survived  Pclass   Sex   Age  SibSp  Parch  Fare Embarked
0         0       3  male  22.0      1      0  7.25        S

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [35]:
df.isna().mean()

Survived    0.000000
Pclass      0.000000
Sex         0.000000
Age         0.198653
SibSp       0.000000
Parch       0.000000
Fare        0.000000
Embarked    0.002245
dtype: float64

In [37]:
# Step 1 -> train/test/split
X_train,X_test,y_train,y_test = train_test_split(df.drop(columns=['Survived']), df['Survived'],test_size=0.2, random_state=42)

In [39]:
X_train['Age'].var()

210.2517072477438

In [43]:
df['age_mean']=X_train['Age'].mean()

In [45]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked   age_mean
0         0       3    male  22.0      1      0   7.2500        S  29.498846
1         1       1  female  38.0      1      0  71.2833        C  29.498846
2         1       3  female  26.0      0      0   7.9250        S  29.498846
3         1       1  female  35.0      1      0  53.1000        S  29.498846
4         0       3    male  35.0      0      0   8.0500        S  29.498846

In [47]:
X_train.Age.var()

210.2517072477438

In [58]:
data={'Age':[23,np.nan,27,30,np.nan],'Salary':[np.nan,500,600,700,1000]}

In [62]:
data=pd.DataFrame(data)

In [86]:
sim=SimpleImputer(strategy='median')

In [66]:
from sklearn.impute import KNNImputer

In [68]:
si=SimpleImputer(strategy='mean')

In [74]:
da_simple=pd.DataFrame(si.fit_transform(data),columns=data.columns)

In [76]:
da_simple.head()

         Age  Salary
0  23.000000   700.0
1  26.666667   500.0
2  27.000000   600.0
3  30.000000   700.0
4  26.666667  1000.0

In [78]:
data.var()

Age          12.333333
Salary    46666.666667
dtype: float64

In [84]:
data,da_simple

(    Age  Salary
 0  23.0     NaN
 1   NaN   500.0
 2  27.0   600.0
 3  30.0   700.0
 4   NaN  1000.0,
          Age  Salary
 0  23.000000   700.0
 1  26.666667   500.0
 2  27.000000   600.0
 3  30.000000   700.0
 4  26.666667  1000.0)

In [99]:
median_data=sim.fit_transform(data)
sim.get_feature_names_out
median_data1=pd.DataFrame(median_data,columns=sim.get_feature_names_out())

In [103]:
da_simple,median_data1

(         Age  Salary
 0  23.000000   700.0
 1  26.666667   500.0
 2  27.000000   600.0
 3  30.000000   700.0
 4  26.666667  1000.0,
     Age  Salary
 0  23.0   650.0
 1  27.0   500.0
 2  27.0   600.0
 3  30.0   700.0
 4  27.0  1000.0)

In [113]:
sic=SimpleImputer(strategy='constant')

In [115]:
sic.fit_transform(data)

array([[  23.,    0.],
       [   0.,  500.],
       [  27.,  600.],
       [  30.,  700.],
       [   0., 1000.]])

In [119]:
num=np.array([67,33,2,5])
position = -1
target = 2